sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/spinlock.h>

#include <assert.h>
#include <debug.h>
#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/spi/spi.h>
#include <nuttx/spi/slave.h>
#include <nuttx/nuttx.h>
#include <nuttx/kmalloc.h>

#include <arch/board/board.h>

#include "esp_cache.h"
#include "esp_heap_caps.h"
#include "esp_private/esp_cache_private.h"
#include "esp_spi.h"
#include "esp_irq.h"
#include "esp_gpio.h"
#include "hal/spi_ll.h"
#include "hal/spi_hal.h"
#include "hal/spi_slave_hal.h"
#include "periph_ctrl.h"
#include "esp_private/spi_share_hw_ctrl.h"
#include "hal/gdma_periph.h"
#include "hal/gdma_ll.h"
#include "hal/dma_types.h"

#if SOC_GDMA_SUPPORTED
#  include "esp_private/gdma.h"
#endif

#include "riscv_internal.h"

#ifdef CONFIG_PM
#  include "include/esp_pm.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
#  define USE_DMA 1
#endif

#ifdef CONFIG_ESPRESSIF_SPI2_SLAVE
#  define SPI_SLAVE_BUFSIZE CONFIG_ESPRESSIF_SPI2_SLAVE_BUFSIZE
#else
#  define SPI_SLAVE_BUFSIZE CONFIG_ESPRESSIF_SPI3_SLAVE_BUFSIZE
#endif

#ifdef USE_DMA
/* SPI DMA RX/TX number of descriptors */

#if (SPI_SLAVE_BUFSIZE % DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED) > 0
#  define SPI_DMA_DESC_NUM (SPI_SLAVE_BUFSIZE / DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED + 1)
#else
#  define SPI_DMA_DESC_NUM (SPI_SLAVE_BUFSIZE / DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED)
#endif

#endif /* USE_DMA */

/* Verify whether SPI has been assigned IOMUX pins.
 * Otherwise, SPI signals will be routed via GPIO Matrix.
 */

#define SPI_IS_CS_IOMUX   (CONFIG_ESPRESSIF_SPI2_CSPIN == SPI2_IOMUX_CSPIN)
#define SPI_IS_CLK_IOMUX  (CONFIG_ESPRESSIF_SPI2_CLKPIN == SPI2_IOMUX_CLKPIN)
#define SPI_IS_MOSI_IOMUX (CONFIG_ESPRESSIF_SPI2_MOSIPIN == SPI2_IOMUX_MOSIPIN)
#define SPI_IS_MISO_IOMUX (CONFIG_ESPRESSIF_SPI2_MISOPIN == SPI2_IOMUX_MISOPIN)

#define SPI_VIA_IOMUX     (SPI_IS_CS_IOMUX) && (SPI_IS_CLK_IOMUX) && \
                          (SPI_IS_MOSI_IOMUX) && (SPI_IS_MISO_IOMUX)

/* SPI Slave default width */

#define SPI_SLAVE_DEFAULT_WIDTH (8)

/* SPI Slave default mode */

#define SPI_SLAVE_DEFAULT_MODE  (SPISLAVE_MODE0)

#define WORDS2BYTES(_priv, _wn)   ((_wn) * ((_priv)->nbits / 8))
#define BYTES2WORDS(_priv, _bn)   ((_bn) / ((_priv)->nbits / 8))

#if defined(SOC_GDMA_BUS_AXI) && \
    (SOC_GDMA_TRIG_PERIPH_SPI2_BUS == SOC_GDMA_BUS_AXI)
#  define SPI_GDMA_NEW_CHANNEL     gdma_new_axi_channel
#elif defined(SOC_GDMA_BUS_AHB) && \
      (SOC_GDMA_TRIG_PERIPH_SPI2_BUS == SOC_GDMA_BUS_AHB)
#  define SPI_GDMA_NEW_CHANNEL    gdma_new_ahb_channel
#endif

#if SOC_GPSPI_SUPPORTED && defined(SOC_GDMA_BUS_AXI) && (SOC_GDMA_TRIG_PERIPH_SPI2_BUS == SOC_GDMA_BUS_AXI)
#  define DMA_DESC_MEM_ALIGN_SIZE 8
typedef dma_descriptor_align8_t spi_dma_desc_t;
#else
#  define DMA_DESC_MEM_ALIGN_SIZE 4
typedef dma_descriptor_align4_t spi_dma_desc_t;
#endif

#if SOC_GDMA_SUPPORTED  /* AHB_DMA_V1 and AXI_DMA */

/* DMA is provided by gdma driver on these targets */

#  define spi_dma_reset               gdma_reset
#  define spi_dma_start(chan, addr)   gdma_start(chan, (intptr_t)(addr))
#endif

#if defined(CONFIG_ESPRESSIF_SPI_BITBANG) && \
  (CONFIG_ESPRESSIF_SPI2_CSPIN == CONFIG_ESPRESSIF_SPI_BITBANG_CSPIN) && \
  (CONFIG_ESPRESSIF_SPI2_CLKPIN == CONFIG_ESPRESSIF_SPI_BITBANG_CLKPIN) && \
  (CONFIG_ESPRESSIF_SPI2_MOSIPIN == CONFIG_ESPRESSIF_SPI_BITBANG_MOSIPIN) && \
  (CONFIG_ESPRESSIF_SPI2_MISOPIN == CONFIG_ESPRESSIF_SPI_BITBANG_MISOPIN)
#  warning "SPI slave driver is in auto-test mode with SPI master provided by bit-bang driver"
#  define SPI_SLAVE_AUTO_TEST_MODE  (1)
#  define CS_PIN_FUNCTION  (INPUT_FUNCTION_2 | OUTPUT_FUNCTION_2 | PULLUP)
#  define CLK_PIN_FUNCTION (INPUT_FUNCTION_2 | OUTPUT_FUNCTION_2 | PULLUP)
#  define MOSI_PIN_FUNCTION (INPUT_FUNCTION_2 | OUTPUT_FUNCTION_2 | PULLUP)
#  define MISO_PIN_FUNCTION (INPUT_FUNCTION_2 | OUTPUT_FUNCTION_2 | PULLUP)
#else
#  if SPI_VIA_IOMUX
#    define CS_PIN_FUNCTION  (INPUT_FUNCTION_3 | PULLUP)
#    define CLK_PIN_FUNCTION (INPUT_FUNCTION_3 | PULLUP)
#    define MOSI_PIN_FUNCTION (INPUT_FUNCTION_3 | PULLUP)
#    define MISO_PIN_FUNCTION (OUTPUT_FUNCTION_3)
#  else
#    define CS_PIN_FUNCTION  (INPUT_FUNCTION_2 | PULLUP)
#    define CLK_PIN_FUNCTION (INPUT_FUNCTION_2 | PULLUP)
#    define MOSI_PIN_FUNCTION (INPUT_FUNCTION_2 | PULLUP)
#    define MISO_PIN_FUNCTION (OUTPUT_FUNCTION_2)
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* SPI Slave controller hardware configuration */

