sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
struct spislave_config_s
{
  int32_t width;              /* SPI Slave default width */
  enum spi_slave_mode_e mode; /* SPI Slave default mode */

  uint8_t cs_pin;             /* GPIO configuration for CS */
  uint8_t mosi_pin;           /* GPIO configuration for MOSI */
  uint8_t miso_pin;           /* GPIO configuration for MISO */
  uint8_t clk_pin;            /* GPIO configuration for CLK */
  uint32_t clk_bit;           /* Clock enable bit */
  uint32_t rst_bit;           /* SPI reset bit */
};

struct spislave_priv_s
{
  /* Externally visible part of the SPI Slave controller interface */

  struct spi_slave_ctrlr_s ctrlr;

  /* Reference to SPI Slave device interface */

  struct spi_slave_dev_s *dev;

  /* Port configuration */

  const struct spislave_config_s *config;
  int refs;                     /* Reference count */
  int cpuint;                   /* SPI interrupt ID */
  enum spi_slave_mode_e mode;   /* Current SPI Slave hardware mode */
#ifdef USE_DMA
  gdma_channel_handle_t dma_channel_tx; /* SPI DMA TX channel being used */
  gdma_channel_handle_t dma_channel_rx; /* SPI DMA RX channel being used */
  spi_dma_desc_t *dma_rxdesc;           /* DMA RX description */
  spi_dma_desc_t *dma_txdesc;           /* DMA TX description */
#endif
  uint8_t nbits;                /* Current configured bit width */
  uint32_t tx_length;           /* Location of next TX value */

  /* SPI Slave TX queue buffer */

  uint8_t *tx_buffer;
  uint32_t rx_length;           /* Location of next RX value */

  /* SPI Slave RX queue buffer */

  uint8_t rx_buffer[SPI_SLAVE_BUFSIZE];
  uint32_t buf_size;           /* SPI DMA Buffer size in bytes */

#ifdef USE_DMA
  /* SPI Slave DMA RX buffer - separate from user-accessible buffer */

  uint8_t *dma_rx_buffer;
#endif

  /* Flag that indicates whether SPI Slave is currently processing */

  bool is_processing;

  /* Flag that indicates whether SPI Slave TX is currently enabled */

  bool is_tx_enabled;
  spi_slave_hal_context_t ctx;  /* Context struct of the common layer */
  spi_slave_hal_config_t cfg;   /* Configuration struct of the common layer */
#ifdef CONFIG_PM
  esp_pm_lock_handle_t pm_lock; /* Power management lock */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* SPI Slave controller buffer operations */

#ifdef USE_DMA
static uint32_t spi_slave_common_dma_setup(int chan, bool tx,
                                           spi_dma_desc_t *dmadesc,
                                           uint32_t num, uint8_t *pbuf,
                                           uint32_t len);
#endif

#ifndef USE_DMA
static inline void spislave_cpu_tx_fifo_reset(spi_dev_t *hw);
#else
static inline void spislave_dma_tx_fifo_reset(spi_dev_t *hw);
static inline void spislave_dma_rx_fifo_reset(spi_dev_t *hw);
#endif

/* SPI Slave controller interrupt handlers */

static int spislave_cs_interrupt(int irq, void *context, void *arg);
static int spislave_periph_interrupt(int irq, void *context, void *arg);

/* SPI Slave controller internal functions */

static void spislave_evict_sent_data(struct spislave_priv_s *priv,
                                     uint32_t sent_bytes);
static inline void spislave_hal_store_result(spi_slave_hal_context_t *hal);
#ifdef USE_DMA
static void spislave_setup_rx_dma(struct spislave_priv_s *priv);
static void spislave_setup_tx_dma(struct spislave_priv_s *priv);
static void spislave_prepare_next_tx(struct spislave_priv_s *priv);
static void spislave_dma_init(struct spislave_priv_s *priv);
#endif
static void spislave_initialize(struct spi_slave_ctrlr_s *ctrlr);

/* SPI Slave controller operations */

static void spislave_bind(struct spi_slave_ctrlr_s *ctrlr,
                          struct spi_slave_dev_s *dev,
                          enum spi_slave_mode_e mode,
                          int nbits);
static void spislave_unbind(struct spi_slave_ctrlr_s *ctrlr);
static int spislave_enqueue(struct spi_slave_ctrlr_s *ctrlr,
                            const void *data,
                            size_t nwords);
static bool spislave_qfull(struct spi_slave_ctrlr_s *ctrlr);
static void spislave_qflush(struct spi_slave_ctrlr_s *ctrlr);
static size_t spislave_qpoll(struct spi_slave_ctrlr_s *ctrlr);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_ESPRESSIF_SPI2

#ifdef CONFIG_ESPRESSIF_SPI2_DMA

/* SPI DMA RX/TX description */

static spi_dma_desc_t dma_rxdesc[SPI_DMA_DESC_NUM];
static spi_dma_desc_t dma_txdesc[SPI_DMA_DESC_NUM];

#endif

static const struct spislave_config_s esp_spi2slave_config =
{
  .width        = SPI_SLAVE_DEFAULT_WIDTH,
  .mode         = SPI_SLAVE_DEFAULT_MODE,
  .cs_pin       = CONFIG_ESPRESSIF_SPI2_CSPIN,
  .mosi_pin     = CONFIG_ESPRESSIF_SPI2_MOSIPIN,
  .miso_pin     = CONFIG_ESPRESSIF_SPI2_MISOPIN,
  .clk_pin      = CONFIG_ESPRESSIF_SPI2_CLKPIN,
};

static const struct spi_slave_ctrlrops_s esp_spi2slave_ops =
{
  .bind     = spislave_bind,
  .unbind   = spislave_unbind,
  .enqueue  = spislave_enqueue,
  .qfull    = spislave_qfull,
  .qflush   = spislave_qflush,
  .qpoll    = spislave_qpoll
};

static struct spislave_priv_s esp_spi2slave_priv =
{
  .ctrlr         =
                  {
                    .ops = &esp_spi2slave_ops
                  },
  .dev           = NULL,
  .config        = &esp_spi2slave_config,
  .refs          = 0,
  .cpuint        = -ENOMEM,
  .mode          = SPISLAVE_MODE0,
  .nbits         = 0,
  .tx_length     = 0,
  .tx_buffer     = NULL,
  .rx_length     = 0,
  .rx_buffer     =
                  {
                    0
                  },
#ifdef CONFIG_ESPRESSIF_SPI2_DMA
  .dma_rxdesc    = dma_rxdesc,
  .dma_txdesc    = dma_txdesc,
  .dma_rx_buffer = NULL,
#endif
  .is_processing = false,
  .is_tx_enabled = false,
  .ctx =
          {
            0
          },
  .cfg =
          {
            .host_id = SPI2_HOST,
          }
};
#endif /* CONFIG_ESPRESSIF_SPI2 */

#ifdef CONFIG_ESPRESSIF_SPI3

#ifdef CONFIG_ESPRESSIF_SPI3_DMA

/* SPI DMA RX/TX description */

static spi_dma_desc_t spi3_dma_rxdesc[SPI_DMA_DESC_NUM];
static spi_dma_desc_t spi3_dma_txdesc[SPI_DMA_DESC_NUM];

#endif

static const struct spislave_config_s esp_spi3slave_config =
{
  .width        = SPI_SLAVE_DEFAULT_WIDTH,
  .mode         = SPI_SLAVE_DEFAULT_MODE,
  .cs_pin       = CONFIG_ESPRESSIF_SPI3_CSPIN,
  .mosi_pin     = CONFIG_ESPRESSIF_SPI3_MOSIPIN,
  .miso_pin     = CONFIG_ESPRESSIF_SPI3_MISOPIN,
  .clk_pin      = CONFIG_ESPRESSIF_SPI3_CLKPIN,
};

static const struct spi_slave_ctrlrops_s esp_spi3slave_ops =
{
  .bind     = spislave_bind,
  .unbind   = spislave_unbind,
  .enqueue  = spislave_enqueue,
  .qfull    = spislave_qfull,
  .qflush   = spislave_qflush,
  .qpoll    = spislave_qpoll
};

static struct spislave_priv_s esp_spi3slave_priv =
{
  .ctrlr         =
                  {
                    .ops = &esp_spi3slave_ops
                  },
  .dev           = NULL,
  .config        = &esp_spi3slave_config,
  .refs          = 0,
  .cpuint        = -ENOMEM,
  .mode          = SPISLAVE_MODE0,
  .nbits         = 0,
  .tx_length     = 0,
  .tx_buffer     = NULL,
  .rx_length     = 0,
  .rx_buffer     =
                  {
                    0
                  },
#ifdef CONFIG_ESPRESSIF_SPI3_DMA
  .dma_rxdesc    = spi3_dma_rxdesc,
  .dma_txdesc    = spi3_dma_txdesc,
  .dma_rx_buffer = NULL,
#endif
  .is_processing = false,
  .is_tx_enabled = false,
  .ctx =
          {
            0
          },
  .cfg =
          {
            .host_id = SPI3_HOST,
          }
};
#endif /* CONFIG_ESPRESSIF_SPI3 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: spi_slave_common_dma_setup
 *
 * Description:
 *   Set up DMA descriptor with given parameters.
 *
 * Input Parameters:
 *   chan    - DMA channel
 *   tx      - true: TX mode; false: RX mode
 *   dmadesc - DMA descriptor pointer
 *   num     - DMA descriptor number
 *   pbuf    - Buffer pointer
 *   len     - Buffer length by byte
 *
 * Returned Value:
 *   Bind pbuf data bytes.
 *
 ****************************************************************************/

#ifdef USE_DMA
static uint32_t spi_slave_common_dma_setup(int chan, bool tx,
                                           spi_dma_desc_t *dmadesc,
                                           uint32_t num, uint8_t *pbuf,
                                           uint32_t len)
{
  int i;
  uint32_t regval;
  uint32_t bytes = len;
  uint8_t *pdata = pbuf;
  uint32_t data_len;
  uint32_t buf_len;
  gdma_channel_direction_t dir = tx == true ? GDMA_CHANNEL_DIRECTION_TX : \
                                              GDMA_CHANNEL_DIRECTION_RX;
  spi_dma_desc_t *dma_desc = (spi_dma_desc_t *)dmadesc;

  DEBUGASSERT(chan >= 0);
  DEBUGASSERT(dmadesc != NULL);
  DEBUGASSERT(num > 0);
  DEBUGASSERT(pbuf != NULL);
  DEBUGASSERT(len > 0);

  for (i = 0; i < num; i++)
    {
      data_len = MIN(bytes, DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED);

      /* Buffer length must be rounded to next 32-bit boundary. */

