sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
      buf_len = ALIGN_UP(data_len, sizeof(uintptr_t));

      dma_desc[i].dw0.size = buf_len;
      dma_desc[i].dw0.length = data_len;
      dma_desc[i].dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;
      dma_desc[i].buffer = pdata;

      dma_desc[i].next = &dma_desc[i + 1];

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
      esp_cache_msync(&dma_desc[i], sizeof(dma_descriptor_t),
                      ESP_CACHE_MSYNC_FLAG_DIR_C2M | \
                      ESP_CACHE_MSYNC_FLAG_UNALIGNED);
#endif

      bytes -= data_len;

      if (bytes == 0)
        {
          break;
        }

      pdata += data_len;
    }

  dma_desc[i].dw0.suc_eof = 1;
  dma_desc[i].next = NULL;

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_msync(&dma_desc[i], sizeof(dma_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | \
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);
#endif

  return len - bytes;
}
#endif

/****************************************************************************
 * Name: spislave_hal_store_result
 *
 * Description:
 *   Get data from SPI peripheral driver and update local buffer. A similar
 *   function is present in the ESP HAL, but it seems there is an issue in
 *   the spi_ll_read_buffer(hal->hw, hal->rx_buffer, hal->rcv_bitlen) call.
 *   Therefore, we are developing our own function to handle this issue.
 *
 * NOTE: We have a similar function in the ESP HAL, but the
 *   spi_ll_read_buffer seems to be receiving the wrong parameter.
 *   This function will address the issue until the Espressif HAL is fixed.
 *
 * Input Parameters:
 *   hw - Beginning address of the HAL context register
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void spislave_hal_store_result(spi_slave_hal_context_t *hal)
{
  hal->rcv_bitlen = spi_ll_slave_get_rcv_bitlen(hal->hw);
  if (hal->rcv_bitlen == hal->bitlen - 1)
    {
      hal->rcv_bitlen++;
    }

  if (!hal->use_dma && hal->rx_buffer)
    {
      spi_ll_read_buffer(hal->hw, hal->rx_buffer, hal->rcv_bitlen);
    }
}

/****************************************************************************
 * Name: spislave_cpu_tx_fifo_reset
 *
 * Description:
 *   Reset the BUF TX AFIFO, which is used to send data out in SPI Slave
 *   CPU-controlled mode transfer.
 *
 * Input Parameters:
 *   hw - Beginning address of the peripheral register
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifndef USE_DMA
static inline void spislave_cpu_tx_fifo_reset(spi_dev_t *hw)
{
  spi_ll_cpu_tx_fifo_reset(hw);
}
#endif

/****************************************************************************
 * Name: spislave_dma_tx_fifo_reset
 *
 * Description:
 *   Reset the DMA TX AFIFO, which is used to send data out in SPI Slave
 *   DMA-controlled mode transfer.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef USE_DMA
static inline void spislave_dma_tx_fifo_reset(spi_dev_t *hw)
{
  spi_ll_dma_tx_fifo_reset(hw);
}
#endif

/****************************************************************************
 * Name: spislave_dma_rx_fifo_reset
 *
 * Description:
 *   Reset the RX AFIFO, which is used to receive data in SPI Slave mode
 *   transfer.
 *
 * Input Parameters:
 *   hw - Beginning address of the peripheral register
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef USE_DMA
static inline void spislave_dma_rx_fifo_reset(spi_dev_t *hw)
{
  spi_ll_dma_rx_fifo_reset(hw);
}
#endif

/****************************************************************************
 * Name: spislave_cs_interrupt
 *
 * Description:
 *   Handler for the GPIO interrupt which is triggered when the chip select
 *   has toggled to inactive state (active high).
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI Slave controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

static int spislave_cs_interrupt(int irq, void *context, void *arg)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)arg;

  if (priv->is_processing)
    {
      priv->is_processing = false;
      SPIS_DEV_SELECT(priv->dev, false);
    }

  return 0;
}

/****************************************************************************
 * Name: spislave_evict_sent_data
 *
 * Description:
 *   Evict from the TX buffer data sent on the latest transaction and update
 *   the length. This is a post transaction operation.
 *
 * Input Parameters:
 *   priv       - Private SPI Slave controller structure
 *   sent_bytes - Number of transmitted bytes
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_evict_sent_data(struct spislave_priv_s *priv,
                                     uint32_t sent_bytes)
{
  if (priv->tx_buffer != NULL)
    {
      if (sent_bytes < priv->tx_length)
        {
          priv->tx_length -= sent_bytes;

          memmove(priv->tx_buffer, priv->tx_buffer + sent_bytes,
                  priv->tx_length);

          memset(priv->tx_buffer + priv->tx_length, 0, sent_bytes);
        }
      else
        {
          priv->tx_length = 0;
        }
    }
}

/****************************************************************************
 * Name: spislave_setup_rx_dma
 *
 * Description:
 *   Configure the SPI Slave peripheral to perform the next RX data transfer
 *   via DMA.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef USE_DMA
static void spislave_setup_rx_dma(struct spislave_priv_s *priv)
{
  uint32_t length = SPI_SLAVE_BUFSIZE;
  int rx_dma_channel_id;

