sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
  gdma_get_group_channel_id(priv->dma_channel_rx, NULL, &rx_dma_channel_id);

  spi_slave_common_dma_setup(rx_dma_channel_id, false, priv->dma_rxdesc,
                             SPI_DMA_DESC_NUM,
                             priv->dma_rx_buffer, length);

  spi_ll_slave_reset(priv->ctx.hw);

  spi_dma_reset(priv->dma_channel_rx);

  spi_ll_dma_rx_fifo_reset(priv->ctx.hw);

  /* Clear input FIFO full error */

  spi_ll_infifo_full_clr(priv->ctx.hw);

  /* Enable SPI DMA RX */

  spi_ll_dma_rx_enable(priv->ctx.hw, true);

  spi_dma_start(priv->dma_channel_rx, priv->dma_rxdesc);
}
#endif

/****************************************************************************
 * Name: spislave_setup_tx_dma
 *
 * Description:
 *   Configure the SPI Slave peripheral to perform the next TX data transfer
 *   via DMA.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef USE_DMA
static void spislave_setup_tx_dma(struct spislave_priv_s *priv)
{
  int tx_dma_channel_id;
  esp_err_t ret;

  if (priv->tx_buffer != NULL)
    {
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
      ret = esp_cache_msync((void *)priv->tx_buffer, SPI_SLAVE_BUFSIZE,
                            ESP_CACHE_MSYNC_FLAG_DIR_C2M);
      assert(ret == ESP_OK);
#endif

      gdma_get_group_channel_id(priv->dma_channel_tx, NULL,
                                &tx_dma_channel_id);

      spi_slave_common_dma_setup(tx_dma_channel_id, true, priv->dma_txdesc,
                                 SPI_DMA_DESC_NUM,
                                 priv->tx_buffer, SPI_SLAVE_BUFSIZE);

      spi_ll_slave_reset(priv->ctx.hw);

      spi_dma_reset(priv->dma_channel_tx);

      spi_ll_dma_tx_fifo_reset(priv->ctx.hw);

      /* Clear output FIFO full error */

      spi_ll_outfifo_empty_clr(priv->ctx.hw);

      /* Enable SPI DMA TX */

      spi_ll_dma_tx_enable(priv->ctx.hw, true);

      spi_dma_start(priv->dma_channel_tx, priv->dma_txdesc);
    }
}
#endif

/****************************************************************************
 * Name: spi_slave_prepare_data
 *
 * Description:
 *   Prepare the SPI Slave controller for transmitting data in CPU-controlled
 *   mode. This function resets the SPI Slave hardware, writes the data to
 *   the TX buffer, and resets the TX FIFO.
 *
 * Input Parameters:
 *   priv           - Private SPI Slave controller structure
 *   nbits_to_send  - Number of bits to send in the next transaction
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifndef USE_DMA
static inline void spi_slave_prepare_data(struct spislave_priv_s *priv,
                      ssize_t nbits_to_send)
{
  spi_ll_slave_reset(priv->ctx.hw);
  spi_ll_write_buffer(priv->ctx.hw, priv->tx_buffer, nbits_to_send);
  spislave_cpu_tx_fifo_reset(priv->ctx.hw);
}
#endif

/****************************************************************************
 * Name: spislave_prepare_next_tx
 *
 * Description:
 *   Prepare the SPI Slave controller for transmitting data on the next
 *   transaction.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_prepare_next_tx(struct spislave_priv_s *priv)
{
  uint32_t nbits_to_send;

  if (priv->tx_length != 0 && priv->tx_buffer != NULL)
    {
#ifdef USE_DMA
      spislave_setup_tx_dma(priv);
#else
      nbits_to_send = priv->nbits * priv->tx_length;
      spi_slave_prepare_data(priv, nbits_to_send);
#endif
      priv->is_tx_enabled = true;
    }
  else
    {
      spiwarn("TX buffer empty! Disabling TX for next transaction\n");

#ifndef USE_DMA
      if (priv->tx_buffer != NULL)
        {
          memset(priv->tx_buffer, 0, SPI_SLAVE_BUFSIZE);
          spi_slave_prepare_data(priv, priv->ctx.rcv_bitlen);
        }
#endif

      priv->is_tx_enabled = false;
    }

    spi_ll_slave_set_rx_bitlen(priv->ctx.hw, priv->ctx.rcv_bitlen);
    spi_ll_slave_set_tx_bitlen(priv->ctx.hw, priv->ctx.rcv_bitlen);
}

/****************************************************************************
 * Name: spislave_periph_interrupt
 *
 * Description:
 *   Handler for the SPI Slave controller interrupt which is triggered when a
 *   transfer is finished.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI Slave controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

static int spislave_periph_interrupt(int irq, void *context, void *arg)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)arg;
  esp_err_t ret;
#ifdef USE_DMA
  uint32_t received_bytes;
#endif

  if (!priv->is_processing)
    {
      SPIS_DEV_SELECT(priv->dev, true);
      priv->is_processing = true;
    }

  /* RX process */

  spislave_hal_store_result(&priv->ctx);

#ifdef USE_DMA

  /* Copy received data from DMA buffer to user-accessible buffer */

  received_bytes = priv->ctx.rcv_bitlen / 8;
  if (received_bytes > 0 && priv->rx_length + received_bytes <=
      SPI_SLAVE_BUFSIZE && priv->dma_rx_buffer != NULL)
    {
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
      ret = esp_cache_msync((void *)priv->dma_rx_buffer, SPI_SLAVE_BUFSIZE,
                            ESP_CACHE_MSYNC_FLAG_DIR_M2C);
      assert(ret == ESP_OK);
#endif
      memcpy(priv->rx_buffer + priv->rx_length, priv->dma_rx_buffer,
             received_bytes);
      priv->rx_length += received_bytes;
    }
#else
  /* Point to the next free position in the buffer */

  priv->ctx.rx_buffer += priv->rx_length;
  priv->rx_length += priv->ctx.rcv_bitlen / priv->nbits;
#endif

  SPIS_DEV_NOTIFY(priv->dev, SPISLAVE_RX_COMPLETE);

#ifdef USE_DMA
  if (priv->rx_length < SPI_SLAVE_BUFSIZE)
    {
      spislave_setup_rx_dma(priv);
    }
#endif

  /* TX process */

  if (priv->ctx.rcv_bitlen > 0 && priv->is_tx_enabled)
    {
      spislave_evict_sent_data(priv, priv->ctx.rcv_bitlen / priv->nbits);
      SPIS_DEV_NOTIFY(priv->dev, SPISLAVE_TX_COMPLETE);
    }

  priv->ctx.bitlen = priv->tx_length;
  priv->ctx.rx_buffer = priv->rx_buffer;
  priv->ctx.tx_buffer = priv->tx_buffer;
  spislave_prepare_next_tx(priv);

  if (priv->is_processing && esp_gpioread(priv->config->cs_pin))
    {
      priv->is_processing = false;
      SPIS_DEV_SELECT(priv->dev, false);
    }

  /* Clear the trans_done interrupt flag */

  spi_ll_clear_intr(priv->ctx.hw, SPI_LL_INTR_TRANS_DONE);

