sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
  /* Trigger the start of user-defined transaction */

  spi_slave_hal_user_start(&priv->ctx);

  return 0;
}

/****************************************************************************
 * Name: spislave_dma_init
 *
 * Description:
 *   Initialize SPI Slave connection to GDMA engine.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef USE_DMA
static void spislave_dma_init(struct spislave_priv_s *priv)
{
  /* Initialize GDMA controller */

  gdma_channel_alloc_config_t tx_handle =
    {
      0
    };

  gdma_channel_alloc_config_t rx_handle =
    {
      0
    };

  gdma_trigger_t periph_trigger;

  /* Request a GDMA channel for SPI peripheral */

  if (priv->cfg.host_id == SPI2_HOST)
    {
      periph_trigger = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_SPI, 2);
    }
#if defined(SOC_GDMA_TRIG_PERIPH_SPI3)
  else if (priv->id == SPI3_HOST)
    {
      periph_trigger = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_SPI, 3);
    }
#endif
  else
    {
      DEBUGASSERT(0);
      return;
    }

  SPI_GDMA_NEW_CHANNEL(&tx_handle, &priv->dma_channel_tx, NULL);
  gdma_connect(priv->dma_channel_tx, periph_trigger);

  SPI_GDMA_NEW_CHANNEL(&rx_handle, NULL, &priv->dma_channel_rx);
  gdma_connect(priv->dma_channel_rx, periph_trigger);
}
#endif

/****************************************************************************
 * Name: spislave_initialize
 *
 * Description:
 *   Initialize SPI Slave hardware interface.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_initialize(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  const struct spislave_config_s *config = priv->config;

  spiinfo("ctrlr=%p\n", ctrlr);

  esp_gpiowrite(config->cs_pin, 1);
  esp_gpiowrite(config->mosi_pin, 1);
  esp_gpiowrite(config->miso_pin, 1);
  esp_gpiowrite(config->clk_pin, 1);

  esp_configgpio(config->cs_pin, CS_PIN_FUNCTION | RISING);
  esp_configgpio(config->mosi_pin, MOSI_PIN_FUNCTION);
  esp_configgpio(config->miso_pin, MISO_PIN_FUNCTION);
  esp_configgpio(config->clk_pin, CLK_PIN_FUNCTION);

#if SPI_VIA_IOMUX && !SPI_SLAVE_AUTO_TEST_MODE
  esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->clk_pin, SIG_GPIO_OUT_IDX, 0, 0);
#else
  esp_gpio_matrix_in(config->cs_pin,
                     spi_periph_signal[priv->cfg.host_id].spics_in, 0);
  esp_gpio_matrix_in(config->mosi_pin,
                     spi_periph_signal[priv->cfg.host_id].spid_in, 0);
  esp_gpio_matrix_out(config->miso_pin,
                      spi_periph_signal[priv->cfg.host_id].spiq_out, 0, 0);
  esp_gpio_matrix_in(config->clk_pin,
                     spi_periph_signal[priv->cfg.host_id].spiclk_in, 0);
#endif

  PERIPH_RCC_ATOMIC()
    {
      spi_ll_enable_bus_clock(priv->cfg.host_id, true);
      spi_ll_reset_register(priv->cfg.host_id);
    }

#ifdef USE_DMA
  spislave_dma_init(priv);
#endif

  esp_gpioirqenable(config->cs_pin);

  priv->ctx.rx_lsbfirst = 0;
  priv->ctx.tx_lsbfirst = 0;

#ifdef USE_DMA
  priv->ctx.dmadesc_n = SPI_DMA_DESC_NUM;
  priv->ctx.use_dma = 1;

  priv->ctx.dmadesc_rx = priv->dma_rxdesc;
  priv->ctx.dmadesc_tx = priv->dma_txdesc;
#else
  priv->ctx.dmadesc_n = 0;
  priv->ctx.use_dma = 0;
#endif

  priv->rx_length = 0;
  priv->tx_length = 0;
  priv->is_tx_enabled = false;

  /* Configure SPI Slave peripheral */

  spi_slave_hal_init(&priv->ctx, &priv->cfg);
  spi_slave_hal_setup_device(&priv->ctx);
}

/****************************************************************************
 * Name: spislave_bind
 *
 * Description:
 *   Bind the SPI Slave device interface to the SPI Slave controller
 *   interface and configure the SPI interface. Upon return, the SPI
 *   slave controller driver is fully operational and ready to perform
 *   transfers.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *   dev   - SPI Slave device interface instance
 *   mode  - The SPI mode requested
 *   nbits - The number of bits requests.
 *            If value is greater than 0, then it implies MSB first
 *            If value is less than 0, then it implies LSB first with -nbits
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *   This implementation currently supports only positive "nbits" values,
 *   i.e., it always configures the SPI Slave controller driver as MSB first.
 *
 ****************************************************************************/

static void spislave_bind(struct spi_slave_ctrlr_s *ctrlr,
                          struct spi_slave_dev_s *dev,
                          enum spi_slave_mode_e mode,
                          int nbits)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  const void *data = NULL;
  irqstate_t flags;
  size_t num_words;
#ifdef USE_DMA
  size_t alignment;
  size_t buffer_size;
#endif

  spiinfo("ctrlr=%p dev=%p mode=%d nbits=%d\n", ctrlr, dev, mode, nbits);

  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(priv->dev == NULL);
  DEBUGASSERT(dev != NULL);
  DEBUGASSERT(nbits > 0);

  flags = enter_critical_section();
#ifdef CONFIG_PM
  esp_pm_lock_acquire(priv->pm_lock);
#endif

  priv->dev = dev;

  SPIS_DEV_SELECT(dev, false);

  SPIS_DEV_CMDDATA(dev, false);

  priv->rx_length = 0;
  priv->tx_length = 0;
  priv->is_tx_enabled = false;
  priv->nbits = nbits;
  priv->ctx.mode = mode;
  priv->ctx.rcv_bitlen = 0;

#ifdef USE_DMA
  /* Allocate DMA RX buffer with proper alignment */

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_get_alignment(MALLOC_CAP_DMA, &alignment);
#else
  alignment = 4;
#endif

  buffer_size = (SPI_SLAVE_BUFSIZE + alignment - 1) & (~(alignment - 1));
  priv->dma_rx_buffer = (uint8_t *)kmm_memalign(alignment, buffer_size);

