sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi_slave.c
static size_t spislave_qpoll(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  irqstate_t flags;
  uint32_t tmp;
  uint32_t recv_n;
  size_t remaining_words = 0;

  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(priv->dev != NULL);

  spiinfo("ctrlr=%p\n", ctrlr);

  flags = enter_critical_section();

  tmp = SPIS_DEV_RECEIVE(priv->dev, priv->rx_buffer,
                         BYTES2WORDS(priv, priv->rx_length));
  recv_n = WORDS2BYTES(priv, tmp);
  if (recv_n < priv->rx_length)
    {
      /* If the upper layer does not receive all of the data from the receive
       * buffer, move the remaining data to the head of the buffer.
       */

      priv->rx_length -= recv_n;
      memmove(priv->rx_buffer, priv->rx_buffer + recv_n, priv->rx_length);
    }
  else
    {
      priv->rx_length = 0;
    }

  remaining_words = BYTES2WORDS(priv, priv->rx_length);

  leave_critical_section(flags);

  return remaining_words;
}

/****************************************************************************
 * Name: esp_spislave_ctrlr_initialize
 *
 * Description:
 *   Initialize the selected SPI Slave bus.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple SPI Slave interfaces)
 *
 * Returned Value:
 *   Valid SPI Slave controller structure reference on success;
 *   NULL on failure.
 *
 ****************************************************************************/

struct spi_slave_ctrlr_s *esp_spislave_ctrlr_initialize(int port)
{
  struct spi_slave_ctrlr_s *spislave_dev;
  struct spislave_priv_s *priv;
  irqstate_t flags;
  int ret;

  switch (port)
    {
#ifdef CONFIG_ESPRESSIF_SPI2
      case ESPRESSIF_SPI2:
        priv = &esp_spi2slave_priv;
        break;
#endif
#ifdef CONFIG_ESPRESSIF_SPI3
      case ESPRESSIF_SPI3:
        priv = &esp_spi3slave_priv;
        break;
#endif

      default:
        return NULL;
    }

  spislave_dev = (struct spi_slave_ctrlr_s *)priv;

  flags = enter_critical_section();

  if ((volatile int)priv->refs != 0)
    {
      leave_critical_section(flags);

      return spislave_dev;
    }

#ifdef CONFIG_PM
#  if CONFIG_ARCH_CHIP_ESP32P4
  ret = esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0,
                           "spi_slave", &priv->pm_lock);
#  else
  ret = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0,
                           "spi_slave", &priv->pm_lock);
#  endif
  if (ret != OK)
    {
      spierr("Failed to create SPI PM lock for SPI slave driver\n");
      leave_critical_section(flags);
      return NULL;
    }
#endif

  /* Attach IRQ for CS pin interrupt */

  ret = esp_gpio_irq(priv->config->cs_pin,
                     spislave_cs_interrupt,
                     priv);
  if (ret != OK)
    {
      /* Failed to attach IRQ for CS pin interrupt. */

      leave_critical_section(flags);

      return NULL;
    }

  if (priv->cpuint != -ENOMEM)
    {
      int irq = ESP_SOURCE2IRQ(spi_periph_signal[priv->cfg.host_id].irq);

      /* Disable the provided CPU Interrupt to configure it. */

      up_disable_irq(irq);
    }

  priv->cpuint = esp_setup_irq(spi_periph_signal[priv->cfg.host_id].irq,
                               ESP_IRQ_PRIORITY_DEFAULT,
                               ESP_IRQ_TRIGGER_LEVEL,
                               spislave_periph_interrupt,
                               priv);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type. */

      leave_critical_section(flags);

      return NULL;
    }

  priv->refs++;

  spislave_initialize(spislave_dev);

  leave_critical_section(flags);

  return spislave_dev;
}

/****************************************************************************
 * Name: esp_spislave_ctrlr_uninitialize
 *
 * Description:
 *   Uninitialize an SPI Slave bus.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   Zero (OK) is returned on success. Otherwise -1 (ERROR).
 *
 ****************************************************************************/

int esp_spislave_ctrlr_uninitialize(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  irqstate_t flags;

  DEBUGASSERT(ctrlr != NULL);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = enter_critical_section();

  if (--priv->refs)
    {
      leave_critical_section(flags);
      return OK;
    }

  up_disable_irq(ESP_SOURCE2IRQ(spi_periph_signal[priv->cfg.host_id].irq));
  esp_teardown_irq(spi_periph_signal[priv->cfg.host_id].irq, priv->cpuint);
  priv->cpuint = -ENOMEM;

  esp_gpioirqdisable(ESP_PIN2IRQ(priv->config->cs_pin));

  /* Disable the trans_done interrupt */

  spi_ll_disable_intr(priv->ctx.hw, SPI_LL_INTR_TRANS_DONE);

  PERIPH_RCC_ATOMIC()
    {
      spi_ll_enable_bus_clock(priv->cfg.host_id, false);
    }

  priv->cpuint = -ENOMEM;
  priv->mode = SPISLAVE_MODE0;
  priv->nbits = 0;
  priv->tx_length = 0;
  priv->rx_length = 0;
  priv->is_processing = false;
  priv->is_tx_enabled = false;
#ifdef CONFIG_PM
  if (priv->pm_lock != NULL)
    {
      esp_pm_lock_delete(priv->pm_lock);
      priv->pm_lock = NULL;
    }
#endif

  leave_critical_section(flags);

  return OK;
}
